# Intro to Data Visualization with Python - PART 1

## Table of Contents

#### 1. Importing Libraries
#### 2. Importing Data
#### 3. Data Wrangling
#### 4. Consistency Checks
#### 5. Merging Data
#### 6. Exporting Data

# 01. Importing libraries

In [3]:
# Import libraries

import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

# 02. Importing Data

In [5]:
# Create path

path = r'C:\Users\16307\Desktop\Tasks - DA Immersion\Instacart Basket Analysis'

In [6]:
# Import customer data set as dataframe

customers = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'))

# 03. Data Wrangling

In [72]:
# Check head

customers.head()

,user_id,first_name,last_name,gender,state,age,date_joined,num_of_dependents,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [9]:
# Check shape

customers.shape

(206209, 10)

## Rename columns

In [24]:
customers.rename(columns = {'First Name' : 'first_name'}, inplace = True)

In [25]:
customers.rename(columns = {'Surnam' : 'last_name'}, inplace = True)

In [26]:
customers.rename(columns = {'Gender' : 'gender'}, inplace = True)

In [27]:
customers.rename(columns = {'STATE' : 'state'}, inplace = True)

In [28]:
customers.rename(columns = {'Age' : 'age'}, inplace = True)

In [29]:
customers.rename(columns = {'n_dependants' : 'num_of_dependents'}, inplace = True)

In [30]:
# Check to see renamed columns

customers.head()

,user_id,first_name,last_name,gender,state,age,date_joined,num_of_dependents,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

# 04. Consistency Checks

## Mixed Types

In [33]:
# Check for mixed types

for col in customers.columns.tolist():
  weird = (customers[[col]].applymap(type) != customers[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (customers[weird]) > 0:
    print (col)

C:\Users\16307\AppData\Local\Temp\ipykernel_13884\2839856405.py:4: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (customers[[col]].applymap(type) != customers[[col]].iloc[0].apply(type)).any(axis = 1)
C:\Users\16307\AppData\Local\Temp\ipykernel_13884\2839856405.py:4: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (customers[[col]].applymap(type) != customers[[col]].iloc[0].apply(type)).any(axis = 1)
C:\Users\16307\AppData\Local\Temp\ipykernel_13884\2839856405.py:4: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (customers[[col]].applymap(type) != customers[[col]].iloc[0].apply(type)).any(axis = 1)
C:\Users\16307\AppData\Local\Temp\ipykernel_13884\2839856405.py:4: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (customers[[col]].applymap(type) != customers[[col]].iloc[0].apply(type)).any(axis = 1)

first_name

C:\Users\16307\AppData\Local\Temp\ipykernel_13884\2839856405.py:4: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (customers[[col]].applymap(type) != customers[[col]].iloc[0].apply(type)).any(axis = 1)
C:\Users\16307\AppData\Local\Temp\ipykernel_13884\2839856405.py:4: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (customers[[col]].applymap(type) != customers[[col]].iloc[0].apply(type)).any(axis = 1)
C:\Users\16307\AppData\Local\Temp\ipykernel_13884\2839856405.py:4: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (customers[[col]].applymap(type) != customers[[col]].iloc[0].apply(type)).any(axis = 1)
C:\Users\16307\AppData\Local\Temp\ipykernel_13884\2839856405.py:4: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (customers[[col]].applymap(type) != customers[[col]].iloc[0].apply(type)).any(axis = 1)
C:\Users\16307\AppData\Local\Temp\ipykernel_13884\2839856405.py:4: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (customers[[col]].applymap(type) != customers[[col]].iloc[0].apply(type)).any(axis = 1)
C:\Users\16307\AppData\Local\Temp\ipykernel_13884\2839856405.py:4: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (customers[[col]].applymap(type) != customers[[col]].iloc[0].apply(type)).any(axis = 1)

In [41]:
# Convert "first_name" column data type to string

customers['first_name'] = customers['first_name'].astype('str')

## Missing Values

In [43]:
# Check for missing values

customers.isnull().sum()

user_id              0
first_name           0
last_name            0
gender               0
state                0
age                  0
date_joined          0
num_of_dependents    0
fam_status           0
income               0
dtype: int64

##### No missing values found

## Duplicates

In [46]:
# Create a subset containing only rows that are duplicates 

customers_dups = customers[customers.duplicated()]

In [47]:
customers_dups

Empty DataFrame
Columns: [user_id, first_name, last_name, gender, state, age, date_joined, num_of_dependents, fam_status, income]
Index: []

##### No duplicates found

# 05. Merging Data

In [50]:
# Import ords_prods_grouped2.pkl

ords_prods_merge = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'ords_prods_grouped2.pkl'))

In [74]:
# Check which column to use as key

ords_prods_merge.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,_merge,...,busiest_day,busiest_days,slowest_days,busiest_period_of_day,max_order,loyalty_flag,mean_price_of_products,spending_flag,median_days_between_orders,order_frequency
0,2539329,1,1,2,8,NaN,196,1,0,both,...,Regularly busy,Regularly busy,Regularly busy,Average orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
1,2539329,1,1,2,8,NaN,14084,2,0,both,...,Regularly busy,Regularly busy,Regularly busy,Average orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
2,2539329,1,1,2,8,NaN,12427,3,0,both,...,Regularly busy,Regularly busy,Regularly busy,Average orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
3,2539329,1,1,2,8,NaN,26088,4,0,both,...,Regularly busy,Regularly busy,Regularly busy,Average orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
4,2539329,1,1,2,8,NaN,26405,5,0,both,...,Regularly busy,Regularly busy,Regularly busy,Average orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer

### Check to see if "user_id" data types are the same in both dataframes

In [53]:
datatypes = customers.dtypes

In [54]:
datatypes

user_id               int64
first_name           object
last_name            object
gender               object
state                object
age                   int64
date_joined          object
num_of_dependents     int64
fam_status           object
income                int64
dtype: object

In [55]:
datatypes2 = ords_prods_merge.dtypes

In [56]:
datatypes2

order_id                         int64
user_id                          int64
order_number                     int64
orders_day_of_week               int64
order_hour_of_day                int64
days_since_prior_order         float64
product_id                       int64
add_to_cart_order                int64
reordered                        int64
_merge                        category
product_name                    object
aisle_id                         int64
department_id                    int64
prices                         float64
price_range_loc                 object
busiest_day                     object
busiest_days                    object
slowest_days                    object
busiest_period_of_day           object
max_order                        int64
loyalty_flag                    object
mean_price_of_products         float64
spending_flag                   object
median_days_between_orders     float64
order_frequency                 object
dtype: object

In [76]:
# Create a new merged dataframe using 'user_id' column as its key

customers_ords_prods_merge = pd.merge(ords_prods_merge, customers, on = ['user_id'], how = 'inner')

In [82]:
# Check head

customers_ords_prods_merge.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,_merge,...,order_frequency,first_name,last_name,gender,state,age,date_joined,num_of_dependents,fam_status,income
0,2539329,1,1,2,8,NaN,196,1,0,both,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
1,2539329,1,1,2,8,NaN,14084,2,0,both,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
2,2539329,1,1,2,8,NaN,12427,3,0,both,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
3,2539329,1,1,2,8,NaN,26088,4,0,both,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
4,2539329,1,1,2,8,NaN,26405,5,0,both,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423

In [84]:
# Check shape

customers_ords_prods_merge.shape

(32404859, 34)

# 06. Exporting Data

In [88]:
# Export to pkl

customers_ords_prods_merge.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'customers_ords_prods_merge.pkl'))